#include <iostream>    
#include <stdlib.h>    
#include <time.h>    

using namespace std;

int money = 100;  //Деньги
int game1(int&, int&);
int game2(int&, int&);
int game3(int&);
int game4(int&);

int main(void)
{
    setlocale(LC_ALL, "Russian");
    int c;          //Переменная для хранения чисел введеных игроком в играх 1 и 2.
    int x;   //Переменная для выбора игры.

    int i = 1;  //Если равно 1, программа начинает работу заново

    do
    {

        int b;    //Переменная для хранения введеной ставки

        //===Получение ставки и проверка на коректность===//
        do
        {
            cout << "+----------------МЕНЮ---------------------+\n";
            cout << "У вас в кармане " << money << " монет\n\n";
            cout << "  Выберите игру\n";
            cout << "1.Рулетка\n";
            cout << "2.Угадай число\n";
            cout << "3.Однорукий бандит\n";
            cout << "4.Открой сейф!\n";
            cout << "+-----------------------------------------+\n";
            cin >> x;
            if (x < 1 || x>4)
            {
                cout << "+--------------WARNING-------------------+\n";
                cout << "Вы ввели некоректные данные, повторите.\n";
                cout << "+----------------------------------------+\n";
                x = 0;
            }
        } while (x < 1 || x>4);



        //Если вы выбрали НЕ игру №3, у вас попросит ввести ставку, и проверит коректность введеной ставки.
        if (x != 3)
        {
            do
            {
                cout << "Сделайте вашу ставку:\n";
                cin >> b;
                if (b > money)
                {
                    cout << "+--------------WARNING-------------------+\n";
                    cout << "\aУ вас не хватает монет для ставви!\n";
                    cout << "+-----------------------------------------+\n";
                }
                else
                {
                    if (b < 1)
                    {
                        cout << "+--------------WARNING-------------------+\n";
                        cout << "Вы должны поставить хотябы одну монету.\n";
                        cout << "+-----------------------------------------+\n";
                    }
                }
            } while (b > money || b < 1);
        }

        //функции с играми, вызывается в зависимости значения переменной int x.
        switch (x)
        {
        case 1: game1(c, b); break;
        case 2: game2(c, b); break;
        case 3: game3(b);    break;
        case 4: game4(b);  break;
        }

        //Запрос, продолжит ли игрок игру или же выйдет, и проверка коректности введеных данных.
        do
        {
            cout << "+-----------------------------------------+\n";
            cout << "У вас " << money << " монет\n";
            cout << "Введите 0: для выхода\n" << "Введите 1: чтобы продолжить игру\n";
            cout << "+-----------------------------------------+\n";
            cin >> i;
            if (i < 0 || i>1)
            {
                cout << "+--------------WARNING-------------------+\n";
                cout << "Вы ввели некоректные данные, повторите.\n";
                cout << "+-----------------------------------------+\n";
            }
        } while (i < 0 || i>1);
    } while (i == 1);

    return 0;
}

inline int game1(int& c, int& b)
{
    srand(time(0));
    int a;
    a = rand() % 15;

    //===Получение числа, проверка на коректность введеного числа===//
    do
    {
        cout << "Введите число от 1 до 15\n";
        cin >> c;

        //Проверка коректности введеного игроком числа.
        if (c > 15)
        {
            cout << "+--------------WARNING-------------------+\n";
            cout << "Вы ввели слишком большое число, повторите\n";
            cout << "+----------------------------------------+\n";
        }
        else
        {
            if (c < 1)
            {
                cout << "+--------------WARNING-------------------+\n";
                cout << "Вы ввели слишком маленькое число, повторите\n";
                cout << "+-----------------------------------------+\n";
            }
        }
    } while (c > 15 || c < 1);

    //Определение победил ли игрок, и сколько он выиграл.
    if (c == a)
    {
        cout << "+--------------ПОБЕДА-------------------+\n";
        cout << "Поздравляю, вы выиграли! Компьютер загадал " << a << "\n";
        b *= 2;
        money += b;
        cout << "Вы получили" << b << "\n";
        cout << "+---------------------------------------+\n";
    }
    else
    {
        cout << "+--------------ПОБЕДА-------------------+\n";
        cout << "Вы проиграли, выпало число " << a << "\n";
        cout << "+---------------------------------------+\n";
        money -= b;
    }

    return 0;
}

inline int game2(int& c, int& b)
{

    srand(time(0));
    int a;
    a = rand() % 50;
    int x = 10;

    do
    {
        cout << "Угадайте число с 10 попыток\n";
        cout << "Введите число от 1 до 50\n";
        cin >> c;

        //Подсказки, больше или меньше введеное игроком число.
        if (c > a)
        {

            cout << "Вы ввели слишком большое число, у вас осталось " << x << " попыток\n";
            x--;
        }
        else
        {
            if (c < a)
            {
                cout << "Вы ввели слишком маленькое число, у вас осталось " << x << " попыток\n";
                x--;
            }
        }

        //Определение победил ли игрок, и сколько он выиграл.
        if (c == a)
        {
            cout << "+--------------ПОБЕДА-------------------+\n";
            cout << "Молодец ты угадал!\n";
            x = 0;
            b *= 2;
            cout << "Вы получили " << b << "\n";
            money += b;
            cout << "+---------------------------------------+\n";
            break;

        }
        else
        {
            if (x == 0)
            {
                cout << "+--------------ПРОИГРЫШ-----------------+\n";
                cout << "Жаль, но ты проиграл.\n";
                cout << "+---------------------------------------+\n";
                money -= b;
                break;
            }
        }
    } while (x != 0);


    return 0;
}

int game3(int& b)
{
    srand(time(0));
    int c[3];  //Массив хранения выпадающих чисел.
    int x;     //Переменная для хранения варианта продолжение игры либо выход.
    int d;     //Переменная для определения начала игры (дергание за ручку).
    do
    {
        for (int i = 0; i < 3; i++)
        {
            int a;
            a = rand() % 10;

            c[i] = a;
        }

        do
        {
            cout << "Дернуть за ручку (введите \"1\")\n";
            cin >> d;
            if (d < 1 || d>1)
            {
                cout << "+--------------WARNING-------------------+\n";
                cout << "Вы ввели некоректные данные, повторите.\n";
                cout << "+-----------------------------------------+\n";
            }
        } while (d < 1 || d>1);
        money -= 5;

        cout << "+---------------------------------------+\n";
        cout << "|" << c[0] << "|" << c[1] << "|" << c[2] << "| \n";
        cout << "+---------------------------------------+\n";

        //Определение победил ли игрок, и сколько он выиграл.
        if (c[0] == c[1] && c[0] == c[2] && c[1] == c[2])
        {
            cout << "+--------------ДжекПот-------------------+\n";
            cout << "Поздравляю вы выиграли ДжекПот\n";
            b = 5 * 10;
            money += b;
            cout << "Ваш выиграш составил " << b << " монет.\n";
            cout << "Ваш баланс" << money << "\n";
            cout << "+-----------------------------------------+\n";
        }
        else
        {
            if (c[0] == c[1] || c[0] == c[2] || c[1] == c[2])
            {
                cout << "+--------------Выиграш-------------------+\n";
                cout << "Поздравляю, совпало 2 цыфры!\n";
                b = 5 * 5;
                money += b;
                cout << "Ваш выиграш составил " << b << " монет.\n";
                cout << "Ваш баланс " << money << "\n";
                cout << "+----------------------------------------+\n";
            }
            else
            {
                cout << "Вы ничего не выиграли.\n";
                cout << "Ваш баланс " << money << "\n";
            }
        }

        //Запрос повторения игры или выход в меню.
        do
        {
            cout << "Повторить игру (Введите \"0\")\n";
            cout << "Выйти из игры (Введите \"1\")\n";
            cin >> x;
            if (x < 0 || x>1)
            {
                cout << "+--------------WARNING-------------------+\n";
                cout << "Вы ввели некоректные данные, повторите.\n";
                cout << "+-----------------------------------------+\n";
            }
        } while (x < 0 || x>1);
    } while (x == 0);

    return 0;
}

int game4(int& b)
{

    srand(time(0));
    int e = 0;               //Переменная для подсчета количества угаданых чисел.
    int w = 1;              //Переменная для определения желает ли игрок повторить игру сначала.
    int q = 0;             //Переменная для подсчета совпадения цыфр в пароле.
    int x = 5;            //Переменная для хранения количества попыток.
    int seif[4];
    int pass[4];

    //Заполнение массива (пароли сейфа)
    do          //Цыкл всей гры(если равен w==0 то игра повторяется)
    {

        cout << "\t\t+-------------------------------------------------+\n";
        cout << "\t\t|                    СЕЙФ                         |\n";
        cout << "\t\t+-------------------------------------------------+\n";

        cout << "*Компьютер загадывает 4 цыфры (пароль)\n";
        cout << "*Вы должны отгадать все 4 цыфры с 5 попыток\n";
        cout << "*Компьютер вам выдает подсказки, сколько цыфр совпало, и сколько из \n совпавших цыфр на своих местах\n";

        for (int i = 0; i < 4; i++)
        {
            int a;
            a = rand() % 10;
            seif[i] = a;
        }

        //=======================================
        //for(int i=0;i<4;i++)
        //{
        //  cout<<seif[i];
        //}
        //cout<<"\n";

        for (int i = 0; i < 4; i++)
        {
            seif[i];
        }

        do         //Цыкл для проверки количества попыток (int x)
        {
            if (x != 0)
            {
                for (int i = 0; i < 4; i++)
                {
                    cout << "Введите " << i + 1 << " цыфру\n";
                    cin >> pass[i];
                }

                for (int i = 0; i < 4; i++)
                {
                    cout << pass[i];
                }
                cout << "\n";

                for (int i = 0; i < 4; i++)
                {
                    for (int j = 0; j < 4; j++)
                    {
                        if (pass[i] == seif[j])
                        {
                            e++;
                        }
                    }
                }

                //+===========Если pass==seif значит цыфра введена равильно и она стоит на своем месте.=======+
                for (int i = 0; i < 4; i++)
                {
                    if (pass[i] == seif[i])
                        q++;
                }
                //+===========================================================================================+

                x--;

                if (q != 4)
                {
                    cout << "Вы угадали " << e << " цыфр, " << q << " из них на своих местах\n";
                    cout << "У вас осталось " << x << " попыток\n";
                    q = 0;
                    e = 0;
                }
                else
                {
                    if (q == 4)
                    {
                        x = 0;             //Если все цыфры совпали, обнуляем счетчик попыток для выхода из цыкла.
                    }
                }
            }
        } while (x != 0);

        if (q == 4)
        {
            cout << "+--------------ПОБЕДА-------------------+\n";
            cout << "Ура, вы открыли сейф\n";
            cout << "+---------------------------------------+\n";
            money = b * 2;
        }
        else
        {
            cout << "+--------------ПРОИГРЫШ-----------------+\n";
            cout << "Вы не сумели открыть сейф, вы проиграли\n";
            cout << "Правильный ответ:\n";
            for (int i = 0; i < 4; i++)
            {
                cout << seif[i] << "\n";
            }
            cout << "+---------------------------------------+\n";
            money -= b;
        }
        x = 5;         //Возвращение баланса попыток на прежний уровень.

        do
        {
            cout << "Повторить игру (Введите \"0\")\n";
            cout << "Выйти из игры (Введите \"1\")\n";
            cin >> w;
            if (w < 0 || w>1)
            {
                cout << "+--------------WARNING-------------------+\n";
                cout << "Вы ввели некоректные данные, повторите.\n";
                cout << "+-----------------------------------------+\n";
            }
        } while (w < 0 || w>1);

    } while (w == 0);

    return 0;
}